{"keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 160, 240, 3], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d", "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d", "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "filters": 24, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "name": "batch_normalization", "config": {"dtype": "float32", "center": true, "axis": [3], "name": "batch_normalization", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]], "name": "activation", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation", 0, 0, {}]]], "name": "max_pooling2d", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d", "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "name": "conv2d_1", "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_1", "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "filters": 24, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"dtype": "float32", "center": true, "axis": [3], "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_2", "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "filters": 24, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"dtype": "float32", "center": true, "axis": [3], "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_3", "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "filters": 24, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"dtype": "float32", "center": true, "axis": [3], "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [3, 3], "dtype": "float32", "pool_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_4", "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "filters": 24, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"dtype": "float32", "center": true, "axis": [3], "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"batch_input_shape": [null, 41], "dtype": "float32", "sparse": false, "name": "input_2"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_4"}}, {"class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding", "config": {"embeddings_regularizer": null, "dtype": "float32", "input_dim": 71, "name": "embedding", "mask_zero": false, "embeddings_constraint": null, "activity_regularizer": null, "trainable": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "input_length": 41, "batch_input_shape": [null, 41], "output_dim": 50}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Bidirectional", "inbound_nodes": [[["embedding", 0, 0, {}]]], "name": "bidirectional", "config": {"trainable": true, "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"stateful": false, "activation": "tanh", "bias_constraint": null, "name": "lstm", "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "trainable": true, "return_sequences": false, "units": 128, "time_major": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "unit_forget_bias": true, "use_bias": true, "unroll": false, "return_state": false, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_regularizer": null, "recurrent_activation": "sigmoid", "go_backwards": false, "kernel_constraint": null, "implementation": 2}}, "dtype": "float32", "name": "bidirectional"}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_1", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_2", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_2", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_3", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_3", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_4", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_4", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_5", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_5", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_6", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_6", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_7", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_7", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_8", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_8", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_9", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_9", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_10", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_10", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_11", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_11", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_12", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_12", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_13", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_13", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_14", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_14", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_15", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_15", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_16", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_16", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Lambda", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "lambda_17", "config": {"output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_17", "output_shape_type": "raw", "output_shape_module": null, "function_type": "lambda", "dtype": "float32", "module": "__main__", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcyAAAAB8AABkAABkAACFAgB0AAB0AQBkAABkAACFAgBmBAAZ\nUykBTikC2gJrMdoCazIpAdoBdKkAcgQAAAD6c0Q6L2NvbGxlZ2VfcG9saW1pL1NlbWVzdGVyIDEv\nQXJ0aWZpY2lhbCBuZXVyYWwgbmV0d29ya3MgYW5kIGRlZXAgbGVhcm5pbmcvQXNzaWdubWVudHMv\nQXNzIDMgdnFhL1JlbGF0aW9uX25ldHdvcmsucHnaC2dldF9mZWF0dXJlRQEAAHMCAAAAAAE=\n", null, null]}}, {"class_name": "Concatenate", "inbound_nodes": [[["lambda", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_1", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_4", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_6", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_8", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_10", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_13", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_14", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_15", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_16", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_1", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_2", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_3", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_4", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_5", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_6", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_7", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_8", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_9", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_10", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_11", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_12", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_13", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_14", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_15", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_16", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["lambda_17", 0, 0, {}], ["lambda_17", 0, 0, {}], ["bidirectional", 0, 0, {}]]], "name": "concatenate", "config": {"trainable": true, "dtype": "float32", "name": "concatenate", "axis": -1}}, {"class_name": "Dense", "inbound_nodes": [[["concatenate", 0, 0, {}]], [["concatenate", 1, 0, {}]], [["concatenate", 2, 0, {}]], [["concatenate", 3, 0, {}]], [["concatenate", 4, 0, {}]], [["concatenate", 5, 0, {}]], [["concatenate", 6, 0, {}]], [["concatenate", 7, 0, {}]], [["concatenate", 8, 0, {}]], [["concatenate", 9, 0, {}]], [["concatenate", 10, 0, {}]], [["concatenate", 11, 0, {}]], [["concatenate", 12, 0, {}]], [["concatenate", 13, 0, {}]], [["concatenate", 14, 0, {}]], [["concatenate", 15, 0, {}]], [["concatenate", 16, 0, {}]], [["concatenate", 17, 0, {}]], [["concatenate", 18, 0, {}]], [["concatenate", 19, 0, {}]], [["concatenate", 20, 0, {}]], [["concatenate", 21, 0, {}]], [["concatenate", 22, 0, {}]], [["concatenate", 23, 0, {}]], [["concatenate", 24, 0, {}]], [["concatenate", 25, 0, {}]], [["concatenate", 26, 0, {}]], [["concatenate", 27, 0, {}]], [["concatenate", 28, 0, {}]], [["concatenate", 29, 0, {}]], [["concatenate", 30, 0, {}]], [["concatenate", 31, 0, {}]], [["concatenate", 32, 0, {}]], [["concatenate", 33, 0, {}]], [["concatenate", 34, 0, {}]], [["concatenate", 35, 0, {}]], [["concatenate", 36, 0, {}]], [["concatenate", 37, 0, {}]], [["concatenate", 38, 0, {}]], [["concatenate", 39, 0, {}]], [["concatenate", 40, 0, {}]], [["concatenate", 41, 0, {}]], [["concatenate", 42, 0, {}]], [["concatenate", 43, 0, {}]], [["concatenate", 44, 0, {}]], [["concatenate", 45, 0, {}]], [["concatenate", 46, 0, {}]], [["concatenate", 47, 0, {}]], [["concatenate", 48, 0, {}]], [["concatenate", 49, 0, {}]], [["concatenate", 50, 0, {}]], [["concatenate", 51, 0, {}]], [["concatenate", 52, 0, {}]], [["concatenate", 53, 0, {}]], [["concatenate", 54, 0, {}]], [["concatenate", 55, 0, {}]], [["concatenate", 56, 0, {}]], [["concatenate", 57, 0, {}]], [["concatenate", 58, 0, {}]], [["concatenate", 59, 0, {}]], [["concatenate", 60, 0, {}]], [["concatenate", 61, 0, {}]], [["concatenate", 62, 0, {}]], [["concatenate", 63, 0, {}]], 