{"backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"layers": [{"class_name": "Model", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}}, {"name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": false, "bias_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 32, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d", "kernel_regularizer": null}}, {"name": "batch_normalization", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation", "activation": "relu", "dtype": "float32", "trainable": false}}, {"name": "conv2d_1", "inbound_nodes": [[["activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 32, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_1", "kernel_regularizer": null}}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "dtype": "float32", "trainable": false}}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null}}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "dtype": "float32", "trainable": false}}, {"name": "max_pooling2d", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "padding": "valid", "trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "max_pooling2d", "strides": [2, 2]}}, {"name": "conv2d_3", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 80, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_3", "kernel_regularizer": null}}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 192, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_4", "kernel_regularizer": null}}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "padding": "valid", "trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"name": "conv2d_8", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_8", "kernel_regularizer": null}}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 48, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_6", "kernel_regularizer": null}}, {"name": "conv2d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 96, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_9", "kernel_regularizer": null}}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "average_pooling2d", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "average_pooling2d", "strides": [1, 1]}}, {"name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_5", "kernel_regularizer": null}}, {"name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [5, 5], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_7", "kernel_regularizer": null}}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 96, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_10", "kernel_regularizer": null}}, {"name": "conv2d_11", "inbound_nodes": [[["average_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 32, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_11", "kernel_regularizer": null}}, {"name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "mixed0", "inbound_nodes": [[["activation_5", 0, 0, {}], ["activation_7", 0, 0, {}], ["activation_10", 0, 0, {}], ["activation_11", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed0", "axis": 3, "dtype": "float32", "trainable": true}}, {"name": "conv2d_15", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_15", "kernel_regularizer": null}}, {"name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_15", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 48, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_13", "kernel_regularizer": null}}, {"name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 96, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_16", "kernel_regularizer": null}}, {"name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_16", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "average_pooling2d_1", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "average_pooling2d_1", "strides": [1, 1]}}, {"name": "conv2d_12", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_12", "kernel_regularizer": null}}, {"name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [5, 5], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_14", "kernel_regularizer": null}}, {"name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 96, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_17", "kernel_regularizer": null}}, {"name": "conv2d_18", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_18", "kernel_regularizer": null}}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_17", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_18", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_17", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_18", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "mixed1", "inbound_nodes": [[["activation_12", 0, 0, {}], ["activation_14", 0, 0, {}], ["activation_17", 0, 0, {}], ["activation_18", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed1", "axis": 3, "dtype": "float32", "trainable": true}}, {"name": "conv2d_22", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_22", "kernel_regularizer": null}}, {"name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_22", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_22", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 48, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_20", "kernel_regularizer": null}}, {"name": "conv2d_23", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 96, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_23", "kernel_regularizer": null}}, {"name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_20", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_23", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_20", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_23", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "average_pooling2d_2", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "average_pooling2d_2", "strides": [1, 1]}}, {"name": "conv2d_19", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_19", "kernel_regularizer": null}}, {"name": "conv2d_21", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [5, 5], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_21", "kernel_regularizer": null}}, {"name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 96, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_24", "kernel_regularizer": null}}, {"name": "conv2d_25", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_25", "kernel_regularizer": null}}, {"name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_19", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_21", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_24", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_25", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_19", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_21", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_24", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_25", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "mixed2", "inbound_nodes": [[["activation_19", 0, 0, {}], ["activation_21", 0, 0, {}], ["activation_24", 0, 0, {}], ["activation_25", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed2", "axis": 3, "dtype": "float32", "trainable": true}}, {"name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_27", "kernel_regularizer": null}}, {"name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_27", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_27", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "conv2d_28", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 96, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_28", "kernel_regularizer": null}}, {"name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_28", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_28", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "conv2d_26", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 384, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_26", "kernel_regularizer": null}}, {"name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 96, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_29", "kernel_regularizer": null}}, {"name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_26", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_29", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_26", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_29", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "padding": "valid", "trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "max_pooling2d_2", "strides": [2, 2]}}, {"name": "mixed3", "inbound_nodes": [[["activation_26", 0, 0, {}], ["activation_29", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed3", "axis": 3, "dtype": "float32", "trainable": true}}, {"name": "conv2d_34", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 128, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_34", "kernel_regularizer": null}}, {"name": "batch_normalization_34", "inbound_nodes": [[["conv2d_34", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_34", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_34", "inbound_nodes": [[["batch_normalization_34", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_34", "activation": "relu", "dtype": "float32", "trainable": true}}, {"name": "conv2d_35", "inbound_nodes": [[["activation_34", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "filters": 128, "kernel_size": [7, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_35", "kernel_regularizer": null}}, {"name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "scale": false, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_35", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null}}, {"name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "class_name": "Activation", "config": {"name": 