{"keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"layers": [{"class_name": "Model", "config": {"output_layers": [["mixed10", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "sparse": false, "dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": false, "dtype": "float32", "name": "conv2d", "padding": "valid", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "filters": 32, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d"}, {"inbound_nodes": [[["conv2d", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "dtype": "float32", "name": "batch_normalization", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization"}, {"inbound_nodes": [[["batch_normalization", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "dtype": "float32", "name": "activation"}, "name": "activation"}, {"inbound_nodes": [[["activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": false, "dtype": "float32", "name": "conv2d_1", "padding": "valid", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "dtype": "float32", "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "dtype": "float32", "name": "activation_1"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": false, "dtype": "float32", "name": "conv2d_2", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "dtype": "float32", "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "dtype": "float32", "name": "activation_2"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [3, 3], "trainable": true, "dtype": "float32", "name": "max_pooling2d", "data_format": "channels_last", "padding": "valid"}, "name": "max_pooling2d"}, {"inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_3", "padding": "valid", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 80, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_3"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_3"}, "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "dtype": "float32", "name": "conv2d_4", "padding": "valid", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 192, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_4"}, "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [3, 3], "trainable": true, "dtype": "float32", "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid"}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_8", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_8"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_8"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_8"}, "name": "activation_8"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_6", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 48, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_6"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "dtype": "float32", "name": "conv2d_9", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 96, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_9"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_6"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_9"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_6"}, "name": "activation_6"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_9"}, "name": "activation_9"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "pool_size": [3, 3], "trainable": true, "dtype": "float32", "name": "average_pooling2d", "data_format": "channels_last", "padding": "same"}, "name": "average_pooling2d"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_5", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_5"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "trainable": true, "dtype": "float32", "name": "conv2d_7", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_7"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "dtype": "float32", "name": "conv2d_10", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 96, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_10"}, {"inbound_nodes": [[["average_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_11", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_11"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_5"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_7"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_10", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_10"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_11", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_11"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_5"}, "name": "activation_5"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_7"}, "name": "activation_7"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_10"}, "name": "activation_10"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_11"}, "name": "activation_11"}, {"inbound_nodes": [[["activation_5", 0, 0, {}], ["activation_7", 0, 0, {}], ["activation_10", 0, 0, {}], ["activation_11", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "dtype": "float32", "name": "mixed0"}, "name": "mixed0"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_15", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_15"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_15", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_15"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_15"}, "name": "activation_15"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_13", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 48, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_13"}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "dtype": "float32", "name": "conv2d_16", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 96, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_16"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_13", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_13"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_16", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_16"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_13"}, "name": "activation_13"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_16"}, "name": "activation_16"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "pool_size": [3, 3], "trainable": true, "dtype": "float32", "name": "average_pooling2d_1", "data_format": "channels_last", "padding": "same"}, "name": "average_pooling2d_1"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_12", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_12"}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "trainable": true, "dtype": "float32", "name": "conv2d_14", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_14"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "dtype": "float32", "name": "conv2d_17", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 96, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_17"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_18", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_18"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_12", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_12"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_14", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_14"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_17", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_17"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_18", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_18"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_12"}, "name": "activation_12"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_14"}, "name": "activation_14"}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_17"}, "name": "activation_17"}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_18"}, "name": "activation_18"}, {"inbound_nodes": [[["activation_12", 0, 0, {}], ["activation_14", 0, 0, {}], ["activation_17", 0, 0, {}], ["activation_18", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "dtype": "float32", "name": "mixed1"}, "name": "mixed1"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_22", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_22"}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_22", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_22"}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_22"}, "name": "activation_22"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_20", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 48, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_20"}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "dtype": "float32", "name": "conv2d_23", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 96, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_23"}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_20", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_20"}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_23", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_23"}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_20"}, "name": "activation_20"}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_23"}, "name": "activation_23"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"strides": [1, 1], "pool_size": [3, 3], "trainable": true, "dtype": "float32", "name": "average_pooling2d_2", "data_format": "channels_last", "padding": "same"}, "name": "average_pooling2d_2"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_19", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_19"}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "trainable": true, "dtype": "float32", "name": "conv2d_21", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_21"}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "dtype": "float32", "name": "conv2d_24", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 96, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_24"}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_25", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_25"}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_19", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_19"}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_21", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_21"}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_24", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_24"}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_25", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_25"}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_19"}, "name": "activation_19"}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_21"}, "name": "activation_21"}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_24"}, "name": "activation_24"}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_25"}, "name": "activation_25"}, {"inbound_nodes": [[["activation_19", 0, 0, {}], ["activation_21", 0, 0, {}], ["activation_24", 0, 0, {}], ["activation_25", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "dtype": "float32", "name": "mixed2"}, "name": "mixed2"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_27", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_27"}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_27", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_27"}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_27"}, "name": "activation_27"}, {"inbound_nodes": [[["activation_27", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "dtype": "float32", "name": "conv2d_28", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 96, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_28"}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_28", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_28"}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_28"}, "name": "activation_28"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "dtype": "float32", "name": "conv2d_26", "padding": "valid", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "filters": 384, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_26"}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "dtype": "float32", "name": "conv2d_29", "padding": "valid", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "filters": 96, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_29"}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_26", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_26"}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_29", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_29"}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_26"}, "name": "activation_26"}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_29"}, "name": "activation_29"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [3, 3], "trainable": true, "dtype": "float32", "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid"}, "name": "max_pooling2d_2"}, {"inbound_nodes": [[["activation_26", 0, 0, {}], ["activation_29", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "dtype": "float32", "name": "mixed3"}, "name": "mixed3"}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "dtype": "float32", "name": "conv2d_34", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_34"}, {"inbound_nodes": [[["conv2d_34", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_34", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_34"}, {"inbound_nodes": [[["batch_normalization_34", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "dtype": "float32", "name": "activation_34"}, "name": "activation_34"}, {"inbound_nodes": [[["activation_34", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [7, 1], "trainable": true, "dtype": "float32", "name": "conv2d_35", "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}, "name": "conv2d_35"}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "dtype": "float32", "name": "batch_normalization_35", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": false}, "name": "batch_normalization_35"}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "class_name": 