{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": [[3, 3], [3, 3]], "name": "conv1_pad", "dtype": "float32", "trainable": false, "data_format": "channels_last"}, "name": "conv1_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"strides": [2, 2], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [7, 7], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv1_conv", "use_bias": true, "filters": 64}, "name": "conv1_conv"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv1_conv", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "pool1_pad", "dtype": "float32", "trainable": false, "data_format": "channels_last"}, "name": "pool1_pad"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["pool1_pad", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "dtype": "float32", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "name": "pool1_pool"}, "name": "pool1_pool"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["pool1_pool", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block1_preact_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv2_block1_preact_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block1_preact_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": false, "activation": "relu", "name": "conv2_block1_preact_relu"}, "name": "conv2_block1_preact_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block1_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2_block1_1_conv", "use_bias": false, "filters": 64}, "name": "conv2_block1_1_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block1_1_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv2_block1_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": false, "activation": "relu", "name": "conv2_block1_1_relu"}, "name": "conv2_block1_1_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv2_block1_2_pad", "dtype": "float32", "trainable": false, "data_format": "channels_last"}, "name": "conv2_block1_2_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block1_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2_block1_2_conv", "use_bias": false, "filters": 64}, "name": "conv2_block1_2_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block1_2_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block1_2_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv2_block1_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block1_2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": false, "activation": "relu", "name": "conv2_block1_2_relu"}, "name": "conv2_block1_2_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block1_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2_block1_0_conv", "use_bias": true, "filters": 256}, "name": "conv2_block1_0_conv"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block1_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2_block1_3_conv", "use_bias": true, "filters": 256}, "name": "conv2_block1_3_conv"}, {"class_name": "Add", "inbound_nodes": [[["conv2_block1_0_conv", 0, 0, {}], ["conv2_block1_3_conv", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "conv2_block1_out"}, "name": "conv2_block1_out"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block1_out", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block2_preact_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv2_block2_preact_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block2_preact_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv2_block2_preact_relu"}, "name": "conv2_block2_preact_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block2_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2_block2_1_conv", "use_bias": false, "filters": 64}, "name": "conv2_block2_1_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block2_1_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv2_block2_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv2_block2_1_relu"}, "name": "conv2_block2_1_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv2_block2_2_pad", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "name": "conv2_block2_2_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block2_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2_block2_2_conv", "use_bias": false, "filters": 64}, "name": "conv2_block2_2_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block2_2_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block2_2_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv2_block2_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block2_2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv2_block2_2_relu"}, "name": "conv2_block2_2_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block2_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2_block2_3_conv", "use_bias": true, "filters": 256}, "name": "conv2_block2_3_conv"}, {"class_name": "Add", "inbound_nodes": [[["conv2_block1_out", 0, 0, {}], ["conv2_block2_3_conv", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "conv2_block2_out"}, "name": "conv2_block2_out"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block2_out", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block3_preact_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv2_block3_preact_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block3_preact_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv2_block3_preact_relu"}, "name": "conv2_block3_preact_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block3_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2_block3_1_conv", "use_bias": false, "filters": 64}, "name": "conv2_block3_1_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block3_1_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv2_block3_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv2_block3_1_relu"}, "name": "conv2_block3_1_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv2_block3_2_pad", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "name": "conv2_block3_2_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block3_2_pad", 0, 0, {}]]], "config": {"strides": [2, 2], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2_block3_2_conv", "use_bias": false, "filters": 64}, "name": "conv2_block3_2_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block3_2_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block3_2_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv2_block3_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block3_2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv2_block3_2_relu"}, "name": "conv2_block3_2_relu"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2_block2_out", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [1, 1], "name": "max_pooling2d"}, "name": "max_pooling2d"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block3_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2_block3_3_conv", "use_bias": true, "filters": 256}, "name": "conv2_block3_3_conv"}, {"class_name": "Add", "inbound_nodes": [[["max_pooling2d", 0, 0, {}], ["conv2_block3_3_conv", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "conv2_block3_out"}, "name": "conv2_block3_out"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block3_out", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block1_preact_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block1_preact_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block1_preact_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block1_preact_relu"}, "name": "conv3_block1_preact_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block1_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block1_1_conv", "use_bias": false, "filters": 128}, "name": "conv3_block1_1_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block1_1_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block1_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block1_1_relu"}, "name": "conv3_block1_1_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv3_block1_2_pad", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "name": "conv3_block1_2_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block1_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block1_2_conv", "use_bias": false, "filters": 128}, "name": "conv3_block1_2_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block1_2_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block1_2_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block1_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block1_2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block1_2_relu"}, "name": "conv3_block1_2_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block1_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block1_0_conv", "use_bias": true, "filters": 512}, "name": "conv3_block1_0_conv"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block1_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block1_3_conv", "use_bias": true, "filters": 512}, "name": "conv3_block1_3_conv"}, {"class_name": "Add", "inbound_nodes": [[["conv3_block1_0_conv", 0, 0, {}], ["conv3_block1_3_conv", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "conv3_block1_out"}, "name": "conv3_block1_out"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block1_out", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block2_preact_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block2_preact_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block2_preact_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block2_preact_relu"}, "name": "conv3_block2_preact_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block2_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block2_1_conv", "use_bias": false, "filters": 128}, "name": "conv3_block2_1_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block2_1_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block2_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block2_1_relu"}, "name": "conv3_block2_1_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv3_block2_2_pad", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "name": "conv3_block2_2_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block2_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block2_2_conv", "use_bias": false, "filters": 128}, "name": "conv3_block2_2_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block2_2_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block2_2_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block2_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block2_2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block2_2_relu"}, "name": "conv3_block2_2_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block2_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block2_3_conv", "use_bias": true, "filters": 512}, "name": "conv3_block2_3_conv"}, {"class_name": "Add", "inbound_nodes": [[["conv3_block1_out", 0, 0, {}], ["conv3_block2_3_conv", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "conv3_block2_out"}, "name": "conv3_block2_out"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block2_out", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block3_preact_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block3_preact_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block3_preact_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block3_preact_relu"}, "name": "conv3_block3_preact_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block3_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block3_1_conv", "use_bias": false, "filters": 128}, "name": "conv3_block3_1_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block3_1_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block3_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block3_1_relu"}, "name": "conv3_block3_1_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv3_block3_2_pad", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "name": "conv3_block3_2_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block3_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block3_2_conv", "use_bias": false, "filters": 128}, "name": "conv3_block3_2_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block3_2_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block3_2_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block3_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block3_2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block3_2_relu"}, "name": "conv3_block3_2_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block3_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block3_3_conv", "use_bias": true, "filters": 512}, "name": "conv3_block3_3_conv"}, {"class_name": "Add", "inbound_nodes": [[["conv3_block2_out", 0, 0, {}], ["conv3_block3_3_conv", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "conv3_block3_out"}, "name": "conv3_block3_out"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block3_out", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block4_preact_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block4_preact_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block4_preact_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block4_preact_relu"}, "name": "conv3_block4_preact_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block4_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block4_1_conv", "use_bias": false, "filters": 128}, "name": "conv3_block4_1_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block4_1_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block4_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block4_1_relu"}, "name": "conv3_block4_1_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv3_block4_2_pad", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "name": "conv3_block4_2_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block4_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block4_2_conv", "use_bias": false, "filters": 128}, "name": "conv3_block4_2_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block4_2_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block4_2_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block4_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block4_2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block4_2_relu"}, "name": "conv3_block4_2_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block4_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block4_3_conv", "use_bias": true, "filters": 512}, "name": "conv3_block4_3_conv"}, {"class_name": "Add", "inbound_nodes": [[["conv3_block3_out", 0, 0, {}], ["conv3_block4_3_conv", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "conv3_block4_out"}, "name": "conv3_block4_out"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block4_out", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block5_preact_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block5_preact_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block5_preact_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block5_preact_relu"}, "name": "conv3_block5_preact_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block5_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block5_1_conv", "use_bias": false, "filters": 128}, "name": "conv3_block5_1_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block5_1_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block5_1_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block5_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block5_1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block5_1_relu"}, "name": "conv3_block5_1_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv3_block5_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv3_block5_2_pad", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "name": "conv3_block5_2_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block5_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block5_2_conv", "use_bias": false, "filters": 128}, "name": "conv3_block5_2_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block5_2_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block5_2_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block5_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block5_2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block5_2_relu"}, "name": "conv3_block5_2_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block5_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block5_3_conv", "use_bias": true, "filters": 512}, "name": "conv3_block5_3_conv"}, {"class_name": "Add", "inbound_nodes": [[["conv3_block4_out", 0, 0, {}], ["conv3_block5_3_conv", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "conv3_block5_out"}, "name": "conv3_block5_out"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block5_out", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block6_preact_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block6_preact_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block6_preact_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block6_preact_relu"}, "name": "conv3_block6_preact_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block6_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block6_1_conv", "use_bias": false, "filters": 128}, "name": "conv3_block6_1_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block6_1_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block6_1_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block6_1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block6_1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block6_1_relu"}, "name": "conv3_block6_1_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv3_block6_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv3_block6_2_pad", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "name": "conv3_block6_2_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block6_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block6_2_conv", "use_bias": false, "filters": 128}, "name": "conv3_block6_2_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block6_2_conv", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block6_2_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block6_2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block6_2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block6_2_relu"}, "name": "conv3_block6_2_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block6_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv3_block6_3_conv", "use_bias": true, "filters": 512}, "name": "conv3_block6_3_conv"}, {"class_name": "Add", "inbound_nodes": [[["conv3_block5_out", 0, 0, {}], ["conv3_block6_3_conv", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "conv3_block6_out"}, "name": "conv3_block6_out"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block6_out", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block7_preact_bn", "center": true, "gamma_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [3], "momentum": 0.99}, "name": "conv3_block7_preact_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block7_preact_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "conv3_block7_preact_relu"}, "name": "conv3_block7_preact_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block7_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": 