{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 256, 256, 3], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "zero_padding2d", "config": {"padding": [[3, 3], [3, 3]], "name": "zero_padding2d", "data_format": "channels_last", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]], "name": "conv1/conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [7, 7], "bias_constraint": null, "kernel_regularizer": null, "name": "conv1/conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1/conv", 0, 0, {}]]], "name": "conv1/bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv1/bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv1/bn", 0, 0, {}]]], "name": "conv1/relu", "config": {"activation": "relu", "name": "conv1/relu", "trainable": false, "dtype": "float32"}}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["conv1/relu", 0, 0, {}]]], "name": "zero_padding2d_1", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_1", "data_format": "channels_last", "trainable": false, "dtype": "float32"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "name": "pool1", "config": {"padding": "valid", "strides": [2, 2], "name": "pool1", "dtype": "float32", "data_format": "channels_last", "trainable": false, "pool_size": [3, 3]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "conv2_block1_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block1_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block1_0_bn", 0, 0, {}]]], "name": "conv2_block1_0_relu", "config": {"activation": "relu", "name": "conv2_block1_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block1_0_relu", 0, 0, {}]]], "name": "conv2_block1_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block1_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]], "name": "conv2_block1_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block1_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]], "name": "conv2_block1_1_relu", "config": {"activation": "relu", "name": "conv2_block1_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]], "name": "conv2_block1_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block1_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["pool1", 0, 0, {}], ["conv2_block1_2_conv", 0, 0, {}]]], "name": "conv2_block1_concat", "config": {"name": "conv2_block1_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}]]], "name": "conv2_block2_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block2_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block2_0_bn", 0, 0, {}]]], "name": "conv2_block2_0_relu", "config": {"activation": "relu", "name": "conv2_block2_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block2_0_relu", 0, 0, {}]]], "name": "conv2_block2_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block2_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]], "name": "conv2_block2_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block2_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]], "name": "conv2_block2_1_relu", "config": {"activation": "relu", "name": "conv2_block2_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]], "name": "conv2_block2_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block2_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}], ["conv2_block2_2_conv", 0, 0, {}]]], "name": "conv2_block2_concat", "config": {"name": "conv2_block2_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}]]], "name": "conv2_block3_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block3_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block3_0_bn", 0, 0, {}]]], "name": "conv2_block3_0_relu", "config": {"activation": "relu", "name": "conv2_block3_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block3_0_relu", 0, 0, {}]]], "name": "conv2_block3_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block3_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]], "name": "conv2_block3_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block3_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]], "name": "conv2_block3_1_relu", "config": {"activation": "relu", "name": "conv2_block3_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]], "name": "conv2_block3_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block3_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}], ["conv2_block3_2_conv", 0, 0, {}]]], "name": "conv2_block3_concat", "config": {"name": "conv2_block3_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}]]], "name": "conv2_block4_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block4_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block4_0_bn", 0, 0, {}]]], "name": "conv2_block4_0_relu", "config": {"activation": "relu", "name": "conv2_block4_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block4_0_relu", 0, 0, {}]]], "name": "conv2_block4_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block4_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block4_1_conv", 0, 0, {}]]], "name": "conv2_block4_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block4_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block4_1_bn", 0, 0, {}]]], "name": "conv2_block4_1_relu", "config": {"activation": "relu", "name": "conv2_block4_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block4_1_relu", 0, 0, {}]]], "name": "conv2_block4_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block4_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}], ["conv2_block4_2_conv", 0, 0, {}]]], "name": "conv2_block4_concat", "config": {"name": "conv2_block4_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}]]], "name": "conv2_block5_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block5_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block5_0_bn", 0, 0, {}]]], "name": "conv2_block5_0_relu", "config": {"activation": "relu", "name": "conv2_block5_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block5_0_relu", 0, 0, {}]]], "name": "conv2_block5_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block5_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block5_1_conv", 0, 0, {}]]], "name": "conv2_block5_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block5_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block5_1_bn", 0, 0, {}]]], "name": "conv2_block5_1_relu", "config": {"activation": "relu", "name": "conv2_block5_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block5_1_relu", 0, 0, {}]]], "name": "conv2_block5_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block5_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}], ["conv2_block5_2_conv", 0, 0, {}]]], "name": "conv2_block5_concat", "config": {"name": "conv2_block5_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}]]], "name": "conv2_block6_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block6_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block6_0_bn", 0, 0, {}]]], "name": "conv2_block6_0_relu", "config": {"activation": "relu", "name": "conv2_block6_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block6_0_relu", 0, 0, {}]]], "name": "conv2_block6_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block6_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block6_1_conv", 0, 0, {}]]], "name": "conv2_block6_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block6_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2_block6_1_bn", 0, 0, {}]]], "name": "conv2_block6_1_relu", "config": {"activation": "relu", "name": "conv2_block6_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_block6_1_relu", 0, 0, {}]]], "name": "conv2_block6_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2_block6_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}], ["conv2_block6_2_conv", 0, 0, {}]]], "name": "conv2_block6_concat", "config": {"name": "conv2_block6_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block6_concat", 0, 0, {}]]], "name": "pool2_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "pool2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["pool2_bn", 0, 0, {}]]], "name": "pool2_relu", "config": {"activation": "relu", "name": "pool2_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool2_relu", 0, 0, {}]]], "name": "pool2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "pool2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["pool2_conv", 0, 0, {}]]], "name": "pool2_pool", "config": {"padding": "valid", "strides": [2, 2], "name": "pool2_pool", "dtype": "float32", "data_format": "channels_last", "trainable": false, "pool_size": [2, 2]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["pool2_pool", 0, 0, {}]]], "name": "conv3_block1_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block1_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block1_0_bn", 0, 0, {}]]], "name": "conv3_block1_0_relu", "config": {"activation": "relu", "name": "conv3_block1_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block1_0_relu", 0, 0, {}]]], "name": "conv3_block1_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block1_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]], "name": "conv3_block1_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block1_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]], "name": "conv3_block1_1_relu", "config": {"activation": "relu", "name": "conv3_block1_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]], "name": "conv3_block1_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block1_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["pool2_pool", 0, 0, {}], ["conv3_block1_2_conv", 0, 0, {}]]], "name": "conv3_block1_concat", "config": {"name": "conv3_block1_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block1_concat", 0, 0, {}]]], "name": "conv3_block2_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block2_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block2_0_bn", 0, 0, {}]]], "name": "conv3_block2_0_relu", "config": {"activation": "relu", "name": "conv3_block2_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block2_0_relu", 0, 0, {}]]], "name": "conv3_block2_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block2_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]], "name": "conv3_block2_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block2_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]], "name": "conv3_block2_1_relu", "config": {"activation": "relu", "name": "conv3_block2_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]], "name": "conv3_block2_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block2_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv3_block1_concat", 0, 0, {}], ["conv3_block2_2_conv", 0, 0, {}]]], "name": "conv3_block2_concat", "config": {"name": "conv3_block2_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block2_concat", 0, 0, {}]]], "name": "conv3_block3_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block3_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block3_0_bn", 0, 0, {}]]], "name": "conv3_block3_0_relu", "config": {"activation": "relu", "name": "conv3_block3_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block3_0_relu", 0, 0, {}]]], "name": "conv3_block3_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block3_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]], "name": "conv3_block3_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block3_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]], "name": "conv3_block3_1_relu", "config": {"activation": "relu", "name": "conv3_block3_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]], "name": "conv3_block3_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block3_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv3_block2_concat", 0, 0, {}], ["conv3_block3_2_conv", 0, 0, {}]]], "name": "conv3_block3_concat", "config": {"name": "conv3_block3_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block3_concat", 0, 0, {}]]], "name": "conv3_block4_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block4_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block4_0_bn", 0, 0, {}]]], "name": "conv3_block4_0_relu", "config": {"activation": "relu", "name": "conv3_block4_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block4_0_relu", 0, 0, {}]]], "name": "conv3_block4_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block4_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]], "name": "conv3_block4_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block4_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]], "name": "conv3_block4_1_relu", "config": {"activation": "relu", "name": "conv3_block4_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]], "name": "conv3_block4_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block4_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv3_block3_concat", 0, 0, {}], ["conv3_block4_2_conv", 0, 0, {}]]], "name": "conv3_block4_concat", "config": {"name": "conv3_block4_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block4_concat", 0, 0, {}]]], "name": "conv3_block5_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block5_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block5_0_bn", 0, 0, {}]]], "name": "conv3_block5_0_relu", "config": {"activation": "relu", "name": "conv3_block5_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block5_0_relu", 0, 0, {}]]], "name": "conv3_block5_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block5_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block5_1_conv", 0, 0, {}]]], "name": "conv3_block5_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block5_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block5_1_bn", 0, 0, {}]]], "name": "conv3_block5_1_relu", "config": {"activation": "relu", "name": "conv3_block5_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block5_1_relu", 0, 0, {}]]], "name": "conv3_block5_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block5_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv3_block4_concat", 0, 0, {}], ["conv3_block5_2_conv", 0, 0, {}]]], "name": "conv3_block5_concat", "config": {"name": "conv3_block5_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block5_concat", 0, 0, {}]]], "name": "conv3_block6_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block6_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block6_0_bn", 0, 0, {}]]], "name": "conv3_block6_0_relu", "config": {"activation": "relu", "name": "conv3_block6_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block6_0_relu", 0, 0, {}]]], "name": "conv3_block6_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block6_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block6_1_conv", 0, 0, {}]]], "name": "conv3_block6_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block6_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block6_1_bn", 0, 0, {}]]], "name": "conv3_block6_1_relu", "config": {"activation": "relu", "name": "conv3_block6_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block6_1_relu", 0, 0, {}]]], "name": "conv3_block6_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block6_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv3_block5_concat", 0, 0, {}], ["conv3_block6_2_conv", 0, 0, {}]]], "name": "conv3_block6_concat", "config": {"name": "conv3_block6_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block6_concat", 0, 0, {}]]], "name": "conv3_block7_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block7_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block7_0_bn", 0, 0, {}]]], "name": "conv3_block7_0_relu", "config": {"activation": "relu", "name": "conv3_block7_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block7_0_relu", 0, 0, {}]]], "name": "conv3_block7_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block7_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block7_1_conv", 0, 0, {}]]], "name": "conv3_block7_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block7_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block7_1_bn", 0, 0, {}]]], "name": "conv3_block7_1_relu", "config": {"activation": "relu", "name": "conv3_block7_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block7_1_relu", 0, 0, {}]]], "name": "conv3_block7_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block7_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv3_block6_concat", 0, 0, {}], ["conv3_block7_2_conv", 0, 0, {}]]], "name": "conv3_block7_concat", "config": {"name": "conv3_block7_concat", "axis": 3, "trainable": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block7_concat", 0, 0, {}]]], "name": "conv3_block8_0_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block8_0_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block8_0_bn", 0, 0, {}]]], "name": "conv3_block8_0_relu", "config": {"activation": "relu", "name": "conv3_block8_0_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block8_0_relu", 0, 0, {}]]], "name": "conv3_block8_1_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "valid", "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block8_1_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block8_1_conv", 0, 0, {}]]], "name": "conv3_block8_1_bn", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "trainable": false, "dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block8_1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv3_block8_1_bn", 0, 0, {}]]], "name": "conv3_block8_1_relu", "config": {"activation": "relu", "name": "conv3_block8_1_relu", "trainable": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_block8_1_relu", 0, 0, {}]]], "name": "conv3_block8_2_conv", "config": {"use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "dtype": "float32", "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv3_block8_2_conv", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv3_block7_concat", 0, 0, {}], ["conv3_block8_2_conv", 0, 0, {}]]], "name": "conv3_block8_concat", "config": {"name": "conv3_block8_concat", "axis": 3, "trainable": false, "dtype": 