{"class_name": "Model", "keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 256, 256, 3], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"class_name": "ZeroPadding2D", "name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "padding": [[3, 3], [3, 3]], "name": "conv1_pad", "dtype": "float32", "trainable": false}}, {"class_name": "Conv2D", "name": "conv1_conv", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"use_bias": true, "filters": 64, "dilation_rate": [1, 1], "dtype": "float32", "trainable": false, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "kernel_size": [7, 7], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv1_bn", "inbound_nodes": [[["conv1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": false, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv1_relu", "dtype": "float32", "trainable": false}}, {"class_name": "ZeroPadding2D", "name": "pool1_pad", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "padding": [[1, 1], [1, 1]], "name": "pool1_pad", "dtype": "float32", "trainable": false}}, {"class_name": "MaxPooling2D", "name": "pool1_pool", "inbound_nodes": [[["pool1_pad", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [3, 3], "dtype": "float32", "trainable": false, "name": "pool1_pool", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2_block1_1_conv", "inbound_nodes": [[["pool1_pool", 0, 0, {}]]], "config": {"use_bias": true, "filters": 64, "dilation_rate": [1, 1], "dtype": "float32", "trainable": false, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2_block1_1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_block1_1_bn", "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": false, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block1_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv2_block1_1_relu", "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv2_block1_1_relu", "dtype": "float32", "trainable": false}}, {"class_name": "Conv2D", "name": "conv2_block1_2_conv", "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 64, "dilation_rate": [1, 1], "dtype": "float32", "trainable": false, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2_block1_2_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_block1_2_bn", "inbound_nodes": [[["conv2_block1_2_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": false, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block1_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv2_block1_2_relu", "inbound_nodes": [[["conv2_block1_2_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv2_block1_2_relu", "dtype": "float32", "trainable": false}}, {"class_name": "Conv2D", "name": "conv2_block1_0_conv", "inbound_nodes": [[["pool1_pool", 0, 0, {}]]], "config": {"use_bias": true, "filters": 256, "dilation_rate": [1, 1], "dtype": "float32", "trainable": false, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2_block1_0_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2_block1_3_conv", "inbound_nodes": [[["conv2_block1_2_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 256, "dilation_rate": [1, 1], "dtype": "float32", "trainable": false, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2_block1_3_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_block1_0_bn", "inbound_nodes": [[["conv2_block1_0_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block1_0_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "conv2_block1_3_bn", "inbound_nodes": [[["conv2_block1_3_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block1_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Add", "name": "conv2_block1_add", "inbound_nodes": [[["conv2_block1_0_bn", 0, 0, {}], ["conv2_block1_3_bn", 0, 0, {}]]], "config": {"name": "conv2_block1_add", "dtype": "float32", "trainable": true}}, {"class_name": "Activation", "name": "conv2_block1_out", "inbound_nodes": [[["conv2_block1_add", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv2_block1_out", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2_block2_1_conv", "inbound_nodes": [[["conv2_block1_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 64, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2_block2_1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_block2_1_bn", "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block2_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv2_block2_1_relu", "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv2_block2_1_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2_block2_2_conv", "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 64, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2_block2_2_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_block2_2_bn", "inbound_nodes": [[["conv2_block2_2_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block2_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv2_block2_2_relu", "inbound_nodes": [[["conv2_block2_2_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv2_block2_2_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2_block2_3_conv", "inbound_nodes": [[["conv2_block2_2_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 256, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2_block2_3_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_block2_3_bn", "inbound_nodes": [[["conv2_block2_3_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block2_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Add", "name": "conv2_block2_add", "inbound_nodes": [[["conv2_block1_out", 0, 0, {}], ["conv2_block2_3_bn", 0, 0, {}]]], "config": {"name": "conv2_block2_add", "dtype": "float32", "trainable": true}}, {"class_name": "Activation", "name": "conv2_block2_out", "inbound_nodes": [[["conv2_block2_add", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv2_block2_out", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2_block3_1_conv", "inbound_nodes": [[["conv2_block2_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 64, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2_block3_1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_block3_1_bn", "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block3_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv2_block3_1_relu", "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv2_block3_1_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2_block3_2_conv", "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 64, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2_block3_2_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_block3_2_bn", "inbound_nodes": [[["conv2_block3_2_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block3_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv2_block3_2_relu", "inbound_nodes": [[["conv2_block3_2_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv2_block3_2_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2_block3_3_conv", "inbound_nodes": [[["conv2_block3_2_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 256, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2_block3_3_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_block3_3_bn", "inbound_nodes": [[["conv2_block3_3_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_block3_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Add", "name": "conv2_block3_add", "inbound_nodes": [[["conv2_block2_out", 0, 0, {}], ["conv2_block3_3_bn", 0, 0, {}]]], "config": {"name": "conv2_block3_add", "dtype": "float32", "trainable": true}}, {"class_name": "Activation", "name": "conv2_block3_out", "inbound_nodes": [[["conv2_block3_add", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv2_block3_out", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block1_1_conv", "inbound_nodes": [[["conv2_block3_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 128, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block1_1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block1_1_bn", "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block1_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv3_block1_1_relu", "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block1_1_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block1_2_conv", "inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 128, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block1_2_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block1_2_bn", "inbound_nodes": [[["conv3_block1_2_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block1_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv3_block1_2_relu", "inbound_nodes": [[["conv3_block1_2_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block1_2_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block1_0_conv", "inbound_nodes": [[["conv2_block3_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 512, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block1_0_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "name": "conv3_block1_3_conv", "inbound_nodes": [[["conv3_block1_2_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 512, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block1_3_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block1_0_bn", "inbound_nodes": [[["conv3_block1_0_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block1_0_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "conv3_block1_3_bn", "inbound_nodes": [[["conv3_block1_3_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block1_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Add", "name": "conv3_block1_add", "inbound_nodes": [[["conv3_block1_0_bn", 0, 0, {}], ["conv3_block1_3_bn", 0, 0, {}]]], "config": {"name": "conv3_block1_add", "dtype": "float32", "trainable": true}}, {"class_name": "Activation", "name": "conv3_block1_out", "inbound_nodes": [[["conv3_block1_add", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block1_out", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block2_1_conv", "inbound_nodes": [[["conv3_block1_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 128, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block2_1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block2_1_bn", "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block2_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv3_block2_1_relu", "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block2_1_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block2_2_conv", "inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 128, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block2_2_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block2_2_bn", "inbound_nodes": [[["conv3_block2_2_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block2_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv3_block2_2_relu", "inbound_nodes": [[["conv3_block2_2_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block2_2_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block2_3_conv", "inbound_nodes": [[["conv3_block2_2_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 512, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block2_3_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block2_3_bn", "inbound_nodes": [[["conv3_block2_3_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block2_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Add", "name": "conv3_block2_add", "inbound_nodes": [[["conv3_block1_out", 0, 0, {}], ["conv3_block2_3_bn", 0, 0, {}]]], "config": {"name": "conv3_block2_add", "dtype": "float32", "trainable": true}}, {"class_name": "Activation", "name": "conv3_block2_out", "inbound_nodes": [[["conv3_block2_add", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block2_out", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block3_1_conv", "inbound_nodes": [[["conv3_block2_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 128, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block3_1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block3_1_bn", "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block3_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv3_block3_1_relu", "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block3_1_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block3_2_conv", "inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 128, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block3_2_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block3_2_bn", "inbound_nodes": [[["conv3_block3_2_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block3_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv3_block3_2_relu", "inbound_nodes": [[["conv3_block3_2_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block3_2_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block3_3_conv", "inbound_nodes": [[["conv3_block3_2_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 512, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block3_3_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block3_3_bn", "inbound_nodes": [[["conv3_block3_3_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block3_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Add", "name": "conv3_block3_add", "inbound_nodes": [[["conv3_block2_out", 0, 0, {}], ["conv3_block3_3_bn", 0, 0, {}]]], "config": {"name": "conv3_block3_add", "dtype": "float32", "trainable": true}}, {"class_name": "Activation", "name": "conv3_block3_out", "inbound_nodes": [[["conv3_block3_add", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block3_out", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block4_1_conv", "inbound_nodes": [[["conv3_block3_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 128, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block4_1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block4_1_bn", "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block4_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv3_block4_1_relu", "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block4_1_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block4_2_conv", "inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 128, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block4_2_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block4_2_bn", "inbound_nodes": [[["conv3_block4_2_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block4_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv3_block4_2_relu", "inbound_nodes": [[["conv3_block4_2_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block4_2_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv3_block4_3_conv", "inbound_nodes": [[["conv3_block4_2_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 512, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv3_block4_3_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_block4_3_bn", "inbound_nodes": [[["conv3_block4_3_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_block4_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Add", "name": "conv3_block4_add", "inbound_nodes": [[["conv3_block3_out", 0, 0, {}], ["conv3_block4_3_bn", 0, 0, {}]]], "config": {"name": "conv3_block4_add", "dtype": "float32", "trainable": true}}, {"class_name": "Activation", "name": "conv3_block4_out", "inbound_nodes": [[["conv3_block4_add", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv3_block4_out", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv4_block1_1_conv", "inbound_nodes": [[["conv3_block4_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 256, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv4_block1_1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv4_block1_1_bn", "inbound_nodes": [[["conv4_block1_1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_block1_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv4_block1_1_relu", "inbound_nodes": [[["conv4_block1_1_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv4_block1_1_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv4_block1_2_conv", "inbound_nodes": [[["conv4_block1_1_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 256, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv4_block1_2_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv4_block1_2_bn", "inbound_nodes": [[["conv4_block1_2_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_block1_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv4_block1_2_relu", "inbound_nodes": [[["conv4_block1_2_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv4_block1_2_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv4_block1_0_conv", "inbound_nodes": [[["conv3_block4_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 1024, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv4_block1_0_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "name": "conv4_block1_3_conv", "inbound_nodes": [[["conv4_block1_2_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 1024, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv4_block1_3_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv4_block1_0_bn", "inbound_nodes": [[["conv4_block1_0_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_block1_0_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "BatchNormalization", "name": "conv4_block1_3_bn", "inbound_nodes": [[["conv4_block1_3_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_block1_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Add", "name": "conv4_block1_add", "inbound_nodes": [[["conv4_block1_0_bn", 0, 0, {}], ["conv4_block1_3_bn", 0, 0, {}]]], "config": {"name": "conv4_block1_add", "dtype": "float32", "trainable": true}}, {"class_name": "Activation", "name": "conv4_block1_out", "inbound_nodes": [[["conv4_block1_add", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv4_block1_out", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv4_block2_1_conv", "inbound_nodes": [[["conv4_block1_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 256, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv4_block2_1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv4_block2_1_bn", "inbound_nodes": [[["conv4_block2_1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_block2_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv4_block2_1_relu", "inbound_nodes": [[["conv4_block2_1_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv4_block2_1_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv4_block2_2_conv", "inbound_nodes": [[["conv4_block2_1_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 256, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv4_block2_2_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv4_block2_2_bn", "inbound_nodes": [[["conv4_block2_2_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_block2_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "conv4_block2_2_relu", "inbound_nodes": [[["conv4_block2_2_bn", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv4_block2_2_relu", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv4_block2_3_conv", "inbound_nodes": [[["conv4_block2_2_relu", 0, 0, {}]]], "config": {"use_bias": true, "filters": 1024, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv4_block2_3_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv4_block2_3_bn", "inbound_nodes": [[["conv4_block2_3_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": [3], "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_block2_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Add", "name": "conv4_block2_add", "inbound_nodes": [[["conv4_block1_out", 0, 0, {}], ["conv4_block2_3_bn", 0, 0, {}]]], "config": {"name": "conv4_block2_add", "dtype": "float32", "trainable": true}}, {"class_name": "Activation", "name": "conv4_block2_out", "inbound_nodes": [[["conv4_block2_add", 0, 0, {}]]], "config": {"activation": "relu", "name": "conv4_block2_out", "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "name": "conv4_block3_1_conv", "inbound_nodes": [[["conv4_block2_out", 0, 0, {}]]], "config": {"use_bias": true, "filters": 256, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv4_block3_1_conv", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv4_block3_1_bn", "inbound_nodes": [[["conv4_block3_1_conv", 0, 0, {}]]], "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, 