{"backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"padding": [[3, 3], [3, 3]], "dtype": "float32", "trainable": false, "name": "conv1_pad", "data_format": "channels_last"}, "name": "conv1_pad"}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 64, "trainable": false, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "kernel_size": [7, 7], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv1_conv"}, {"inbound_nodes": [[["conv1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv1_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv1_bn"}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "conv1_relu"}, "name": "conv1_relu"}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "dtype": "float32", "trainable": false, "name": "pool1_pad", "data_format": "channels_last"}, "name": "pool1_pad"}, {"inbound_nodes": [[["pool1_pad", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "trainable": false, "data_format": "channels_last", "dtype": "float32", "pool_size": [3, 3], "name": "pool1_pool"}, "name": "pool1_pool"}, {"inbound_nodes": [[["pool1_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 64, "trainable": false, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_block1_1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv2_block1_1_conv"}, {"inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv2_block1_1_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2_block1_1_bn"}, {"inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "conv2_block1_1_relu"}, "name": "conv2_block1_1_relu"}, {"inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 64, "trainable": false, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_block1_2_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv2_block1_2_conv"}, {"inbound_nodes": [[["conv2_block1_2_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv2_block1_2_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2_block1_2_bn"}, {"inbound_nodes": [[["conv2_block1_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "conv2_block1_2_relu"}, "name": "conv2_block1_2_relu"}, {"inbound_nodes": [[["pool1_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_block1_0_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv2_block1_0_conv"}, {"inbound_nodes": [[["conv2_block1_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_block1_3_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv2_block1_3_conv"}, {"inbound_nodes": [[["conv2_block1_0_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv2_block1_0_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2_block1_0_bn"}, {"inbound_nodes": [[["conv2_block1_3_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv2_block1_3_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2_block1_3_bn"}, {"inbound_nodes": [[["conv2_block1_0_bn", 0, 0, {}], ["conv2_block1_3_bn", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "name": "conv2_block1_add", "trainable": true}, "name": "conv2_block1_add"}, {"inbound_nodes": [[["conv2_block1_add", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv2_block1_out"}, "name": "conv2_block1_out"}, {"inbound_nodes": [[["conv2_block1_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 64, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_block2_1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv2_block2_1_conv"}, {"inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv2_block2_1_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2_block2_1_bn"}, {"inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv2_block2_1_relu"}, "name": "conv2_block2_1_relu"}, {"inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 64, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_block2_2_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv2_block2_2_conv"}, {"inbound_nodes": [[["conv2_block2_2_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv2_block2_2_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2_block2_2_bn"}, {"inbound_nodes": [[["conv2_block2_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv2_block2_2_relu"}, "name": "conv2_block2_2_relu"}, {"inbound_nodes": [[["conv2_block2_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 256, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_block2_3_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv2_block2_3_conv"}, {"inbound_nodes": [[["conv2_block2_3_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv2_block2_3_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2_block2_3_bn"}, {"inbound_nodes": [[["conv2_block1_out", 0, 0, {}], ["conv2_block2_3_bn", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "name": "conv2_block2_add", "trainable": true}, "name": "conv2_block2_add"}, {"inbound_nodes": [[["conv2_block2_add", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv2_block2_out"}, "name": "conv2_block2_out"}, {"inbound_nodes": [[["conv2_block2_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 64, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_block3_1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv2_block3_1_conv"}, {"inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv2_block3_1_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2_block3_1_bn"}, {"inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv2_block3_1_relu"}, "name": "conv2_block3_1_relu"}, {"inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 64, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_block3_2_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv2_block3_2_conv"}, {"inbound_nodes": [[["conv2_block3_2_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv2_block3_2_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2_block3_2_bn"}, {"inbound_nodes": [[["conv2_block3_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv2_block3_2_relu"}, "name": "conv2_block3_2_relu"}, {"inbound_nodes": [[["conv2_block3_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 256, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_block3_3_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv2_block3_3_conv"}, {"inbound_nodes": [[["conv2_block3_3_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv2_block3_3_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2_block3_3_bn"}, {"inbound_nodes": [[["conv2_block2_out", 0, 0, {}], ["conv2_block3_3_bn", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "name": "conv2_block3_add", "trainable": true}, "name": "conv2_block3_add"}, {"inbound_nodes": [[["conv2_block3_add", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv2_block3_out"}, "name": "conv2_block3_out"}, {"inbound_nodes": [[["conv2_block3_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block1_1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block1_1_conv"}, {"inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block1_1_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block1_1_bn"}, {"inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block1_1_relu"}, "name": "conv3_block1_1_relu"}, {"inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block1_2_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block1_2_conv"}, {"inbound_nodes": [[["conv3_block1_2_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block1_2_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block1_2_bn"}, {"inbound_nodes": [[["conv3_block1_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block1_2_relu"}, "name": "conv3_block1_2_relu"}, {"inbound_nodes": [[["conv2_block3_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 512, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block1_0_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block1_0_conv"}, {"inbound_nodes": [[["conv3_block1_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 512, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block1_3_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block1_3_conv"}, {"inbound_nodes": [[["conv3_block1_0_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block1_0_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block1_0_bn"}, {"inbound_nodes": [[["conv3_block1_3_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block1_3_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block1_3_bn"}, {"inbound_nodes": [[["conv3_block1_0_bn", 0, 0, {}], ["conv3_block1_3_bn", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "name": "conv3_block1_add", "trainable": true}, "name": "conv3_block1_add"}, {"inbound_nodes": [[["conv3_block1_add", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block1_out"}, "name": "conv3_block1_out"}, {"inbound_nodes": [[["conv3_block1_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block2_1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block2_1_conv"}, {"inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block2_1_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block2_1_bn"}, {"inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block2_1_relu"}, "name": "conv3_block2_1_relu"}, {"inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block2_2_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block2_2_conv"}, {"inbound_nodes": [[["conv3_block2_2_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block2_2_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block2_2_bn"}, {"inbound_nodes": [[["conv3_block2_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block2_2_relu"}, "name": "conv3_block2_2_relu"}, {"inbound_nodes": [[["conv3_block2_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 512, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block2_3_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block2_3_conv"}, {"inbound_nodes": [[["conv3_block2_3_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block2_3_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block2_3_bn"}, {"inbound_nodes": [[["conv3_block1_out", 0, 0, {}], ["conv3_block2_3_bn", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "name": "conv3_block2_add", "trainable": true}, "name": "conv3_block2_add"}, {"inbound_nodes": [[["conv3_block2_add", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block2_out"}, "name": "conv3_block2_out"}, {"inbound_nodes": [[["conv3_block2_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block3_1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block3_1_conv"}, {"inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block3_1_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block3_1_bn"}, {"inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block3_1_relu"}, "name": "conv3_block3_1_relu"}, {"inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block3_2_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block3_2_conv"}, {"inbound_nodes": [[["conv3_block3_2_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block3_2_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block3_2_bn"}, {"inbound_nodes": [[["conv3_block3_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block3_2_relu"}, "name": "conv3_block3_2_relu"}, {"inbound_nodes": [[["conv3_block3_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 512, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block3_3_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block3_3_conv"}, {"inbound_nodes": [[["conv3_block3_3_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block3_3_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block3_3_bn"}, {"inbound_nodes": [[["conv3_block2_out", 0, 0, {}], ["conv3_block3_3_bn", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "name": "conv3_block3_add", "trainable": true}, "name": "conv3_block3_add"}, {"inbound_nodes": [[["conv3_block3_add", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block3_out"}, "name": "conv3_block3_out"}, {"inbound_nodes": [[["conv3_block3_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block4_1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block4_1_conv"}, {"inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block4_1_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block4_1_bn"}, {"inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block4_1_relu"}, "name": "conv3_block4_1_relu"}, {"inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block4_2_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block4_2_conv"}, {"inbound_nodes": [[["conv3_block4_2_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block4_2_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block4_2_bn"}, {"inbound_nodes": [[["conv3_block4_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block4_2_relu"}, "name": "conv3_block4_2_relu"}, {"inbound_nodes": [[["conv3_block4_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 512, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_block4_3_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv3_block4_3_conv"}, {"inbound_nodes": [[["conv3_block4_3_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv3_block4_3_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv3_block4_3_bn"}, {"inbound_nodes": [[["conv3_block3_out", 0, 0, {}], ["conv3_block4_3_bn", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "name": "conv3_block4_add", "trainable": true}, "name": "conv3_block4_add"}, {"inbound_nodes": [[["conv3_block4_add", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv3_block4_out"}, "name": "conv3_block4_out"}, {"inbound_nodes": [[["conv3_block4_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 256, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv4_block1_1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv4_block1_1_conv"}, {"inbound_nodes": [[["conv4_block1_1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv4_block1_1_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv4_block1_1_bn"}, {"inbound_nodes": [[["conv4_block1_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv4_block1_1_relu"}, "name": "conv4_block1_1_relu"}, {"inbound_nodes": [[["conv4_block1_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 256, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv4_block1_2_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv4_block1_2_conv"}, {"inbound_nodes": [[["conv4_block1_2_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv4_block1_2_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv4_block1_2_bn"}, {"inbound_nodes": [[["conv4_block1_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv4_block1_2_relu"}, "name": "conv4_block1_2_relu"}, {"inbound_nodes": [[["conv3_block4_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 1024, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv4_block1_0_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv4_block1_0_conv"}, {"inbound_nodes": [[["conv4_block1_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 1024, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv4_block1_3_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv4_block1_3_conv"}, {"inbound_nodes": [[["conv4_block1_0_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv4_block1_0_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv4_block1_0_bn"}, {"inbound_nodes": [[["conv4_block1_3_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv4_block1_3_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv4_block1_3_bn"}, {"inbound_nodes": [[["conv4_block1_0_bn", 0, 0, {}], ["conv4_block1_3_bn", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "name": "conv4_block1_add", "trainable": true}, "name": "conv4_block1_add"}, {"inbound_nodes": [[["conv4_block1_add", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv4_block1_out"}, "name": "conv4_block1_out"}, {"inbound_nodes": [[["conv4_block1_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 256, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv4_block2_1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv4_block2_1_conv"}, {"inbound_nodes": [[["conv4_block2_1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv4_block2_1_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv4_block2_1_bn"}, {"inbound_nodes": [[["conv4_block2_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv4_block2_1_relu"}, "name": "conv4_block2_1_relu"}, {"inbound_nodes": [[["conv4_block2_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 256, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv4_block2_2_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv4_block2_2_conv"}, {"inbound_nodes": [[["conv4_block2_2_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv4_block2_2_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv4_block2_2_bn"}, {"inbound_nodes": [[["conv4_block2_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv4_block2_2_relu"}, "name": "conv4_block2_2_relu"}, {"inbound_nodes": [[["conv4_block2_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 1024, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv4_block2_3_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv4_block2_3_conv"}, {"inbound_nodes": [[["conv4_block2_3_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "epsilon": 1.001e-05, "axis": [3], "name": "conv4_block2_3_bn", "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv4_block2_3_bn"}, {"inbound_nodes": [[["conv4_block1_out", 0, 0, {}], ["conv4_block2_3_bn", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "name": "conv4_block2_add", "trainable": true}, "name": "conv4_block2_add"}, {"inbound_nodes": [[["conv4_block2_add", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "conv4_block2_out"}, "name": "conv4_block2_out"}, {"inbound_nodes": [[["conv4_block2_out", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 256, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv4_block3_1_conv", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}, "name": "conv4_block3_1_conv"}, {"inbound_nodes": [[["conv4_block3_1_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", 